app/Controllers/AuthController.php

    public function login()
    {
        $usernameInput = trim((string) (
            $this->request->getPost('username')
            ?? $this->request->getPost('email')
            ?? $this->request->getPost('nama')
        ));
        $password = (string) $this->request->getPost('password');

        if ($usernameInput === '' || $password === '') {
            return redirect()->back()->withInput()->with('msg', 'Username dan password wajib diisi.');
        }

        $usernameLower = strtolower($usernameInput);

        try {
            $adminModel = new AdminModel();
            $admin = $adminModel
                ->groupStart()
                ->where('nama', $usernameInput)
                ->orWhere('email', $usernameLower)
                ->groupEnd()
                ->first();
            $adminCount = $adminModel->countAll();
---
SELECT *
FROM "admins"
WHERE   (
"nama" = 'hasan_nazila'
OR "email" = 'hasan_nazila'
 )
 LIMIT 1
SELECT COUNT(*) AS "numrows" FROM "admins"