app/Controllers/AuthController.php

    public function loginProcess()
    {
        $model = new AdminModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $user = $model->where('nama', $email)->first();
---
SELECT *
FROM `admins`
WHERE `nama` = '123'
 LIMIT 1