app/Controllers/DashboardController.php

SELECT *
FROM `program`
---
    public function index()
    {
        $data['programs'] = $this->programModel->findAll();

SELECT *
FROM `program`
WHERE `program`.`id` = '7'
SELECT *
FROM "program"
SELECT `transaksi`.*, `jamaah`.`nama_jamaah`
FROM `transaksi`
JOIN `jamaah` ON `transaksi`.`id_jamaah` = `jamaah`.`id`
WHERE `id_program` = '7'
---
    public function viewProgramTransactions($id_program)
    {
        $program = $this->programModel->find($id_program);
        if (!$program) {
            return redirect()->to('/dashboard')->with('error', 'Program tidak ditemukan.');
        }

        $transaksi = $this->transaksiModel
            ->select('transaksi.*, jamaah.nama_jamaah')
            ->where('id_program', $id_program)
            ->join('jamaah', 'transaksi.id_jamaah = jamaah.id')
            ->findAll();

SELECT `transaksi`.*, `jamaah`.`nama_jamaah`
FROM `transaksi`
JOIN `jamaah` ON `transaksi`.`id_jamaah` = `jamaah`.`id`
WHERE `transaksi`.`id` = '3'
 LIMIT 1
---
    private function editDP($id, $dpField)
    {
        $transaksi = $this->transaksiModel
            ->select('transaksi.*, jamaah.nama_jamaah')
            ->join('jamaah', 'transaksi.id_jamaah = jamaah.id')
            ->where('transaksi.id', $id)
            ->first();

SELECT *
FROM `transaksi`
WHERE `transaksi`.`id` = '47'
UPDATE `transaksi` SET `dp3` = '1000', `dp3_time_edit` = '2025-01-14 13:57:43'
WHERE `transaksi`.`id` IN ('47')
---
    public function updateDP($id)
    {
        $dpField = $this->request->getPost('dpField');
        $dpValue = str_replace(',', '', $this->request->getPost('dpValue')); // Hilangkan koma sebelum menyimpan

        // Ambil data transaksi berdasarkan ID
        $transaksi = $this->transaksiModel->find($id);
        if (!$transaksi) {
            return redirect()->back()->with('error', 'Transaksi tidak ditemukan.');
        }

        // Tentukan nama kolom waktu edit untuk DP yang diubah
        $timeEditField = $dpField . '_time_edit';

        // Siapkan data untuk update
        $updateData = [
            $dpField => $dpValue,
            $timeEditField => date('Y-m-d H:i:s')
        ];

        $this->transaksiModel->update($id, $updateData);