app/Controllers/KeuanganController.php

    public function index()
    {
        // Ambil total harga dan total kekurangan dari tabel transaksi
        $totalHarga = $this->transaksiModel->selectSum('harga')->get()->getRow()->harga;
        $totalKekurangan = $this->transaksiModel->selectSum('kekurangan')->get()->getRow()->kekurangan;
---
SELECT SUM(`harga`) AS `harga`
FROM `transaksi`
SELECT SUM(`kekurangan`) AS `kekurangan`
FROM `transaksi`