app/Controllers/ProgramController.php

    public function saveProgram()
    {
        // Validasi input
        if (!$this->validate([
            'nama_program' => 'required|min_length[3]|max_length[255]',
            'tanggal_program' => 'required|valid_date',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Ambil model program
        $programModel = new ProgramModel();

        // Simpan data ke database
        $programModel->save([
            'nama_program' => $this->request->getPost('nama_program'),
            'tanggal_program' => $this->request->getPost('tanggal_program')
        ]);
---
INSERT INTO `program` (`nama_program`, `tanggal_program`) VALUES ('Program Contoh', '2025-01-09')