app/Controllers/TransaksiController.php

SELECT *
FROM `jamaah`
SELECT *
FROM `program`
---
    public function addTransaksi()
    {
        $redirect = $this->requireAdmin();
        if ($redirect !== null) {
            return $redirect;
        }

        $jamaahModel = new JamaahModel();
        $programModel = new ProgramModel();

        $data['jamaah'] = $jamaahModel->findAll();
        $data['programs'] = $programModel->findAll();