app/Controllers/UserApprovalController.php

    public function updateRole(int $adminId)
    {
        $redirect = $this->requireSuperAdmin();
        if ($redirect !== null) {
            return $redirect;
        }

        $targetRole = strtolower(trim((string) $this->request->getPost('role')));
        if (! in_array($targetRole, [self::ROLE_ADMIN, self::ROLE_VIEWER], true)) {
            return redirect()->to('/dashboard/users')->with('error', 'Role tidak valid.');
        }

        $adminModel = new AdminModel();
        $targetUser = $adminModel->find($adminId);
---
SELECT *
FROM "admins"
WHERE "admins"."id" = 3

            return redirect()->to('/dashboard/users')->with('success', 'Role tidak berubah karena nilainya sama.');
        }

        $adminModel->update($adminId, [
            'role' => $targetRole,
            'approved_by' => $currentAdminId,
            'approved_at' => date('Y-m-d H:i:s'),
        ]);
---
UPDATE "admins" SET "role" = 'admin', "approved_by" = 2, "approved_at" = '2026-03-07 21:15:14'
WHERE "admins"."id" IN (3)